; domain
(define (domain castle_escape)
    (:requirements :strips :typing :negative-preconditions)
    (:types
        room
        key
    )
    (:predicates
        (at ?r - room)
        (opens_with ?r - room ?k1 - key ?k2 - key)
        (opened_with ?r - room ?k1 - key ?k2 - key)
        (has_key ?k - key ?r - room)
        (got_key ?k - key)
        (blocks ?r1 - room ?r2 - room)
        (blocked ?r - room)
    )

    (:action move
        :parameters (?from - room ?to - room ?bl - room ?k1 - key ?k2 - key)
        :precondition (and (at ?from) (not (blocked ?to))
                           (opens_with ?to ?k1 ?k2) (got_key ?k1) (got_key ?k2) (blocks ?to ?bl))
        :effect (and (blocked ?bl) (not (at ?from)) (at ?to) (opened_with ?to ?k1 ?k2)
        )
    )

    (:action pickup_key
        :parameters (?r - room ?k - key)
        :precondition (and (at ?r) (has_key ?k ?r))
        :effect (got_key ?k)
    )
)

; problem
(define (problem castle_escape_problem) 
    (:domain castle_escape)
    (:objects
        whispering_gallery enchanted_hall mirror_chamber dragon_lair wizards_study
        moonlit_grove shadowy_vault sunken_crypt frozen_cell phantom_corridor
        serpents_nest knights_hall golden_sanctum crystal_cove mystic_garden
        starlit_tower silent_tomb echoing_cavern haunted_chamber forbidden_throne - room
        sapphire_key ruby_key emerald_key diamond_key amethyst_key
        topaz_key opal_key pearl_key garnet_key onyx_key
        moonstone_key sunstone_key quartz_key turquoise_key jade_key
        obsidian_key amber_key citrine_key lapis_key agate_key - key
    )
    (:init
        (at whispering_gallery)

        (opens_with shadowy_vault topaz_key pearl_key)
        (opens_with sunken_crypt opal_key garnet_key)
        (opens_with frozen_cell pearl_key onyx_key)
        (opens_with phantom_corridor garnet_key moonstone_key)
        (opens_with enchanted_hall sapphire_key emerald_key)
        (opens_with mirror_chamber ruby_key diamond_key)
        (opens_with dragon_lair emerald_key amethyst_key)
        (opens_with wizards_study diamond_key topaz_key)
        (opens_with moonlit_grove amethyst_key opal_key)
        (opens_with knights_hall moonstone_key quartz_key)
        (opens_with golden_sanctum sunstone_key turquoise_key)
        (opens_with crystal_cove quartz_key jade_key)
        (opens_with mystic_garden turquoise_key obsidian_key)
        (opens_with starlit_tower jade_key amber_key)
        (opens_with echoing_cavern amber_key lapis_key)
        (opens_with haunted_chamber citrine_key agate_key)
        (opens_with forbidden_throne lapis_key agate_key)
        (opens_with serpents_nest onyx_key sunstone_key)
        (opens_with silent_tomb obsidian_key citrine_key)

        (has_key sapphire_key whispering_gallery)
        (has_key emerald_key whispering_gallery)
        (has_key ruby_key enchanted_hall)
        (has_key sunstone_key phantom_corridor)
        (has_key quartz_key serpents_nest)
        (has_key opal_key wizards_study)
        (has_key pearl_key moonlit_grove)
        (has_key garnet_key shadowy_vault)
        (has_key onyx_key sunken_crypt)
        (has_key moonstone_key frozen_cell)
        (has_key jade_key knights_hall)
        (has_key obsidian_key crystal_cove)
        (has_key amber_key mystic_garden)
        (has_key citrine_key starlit_tower)
        (has_key lapis_key silent_tomb)
        (has_key agate_key echoing_cavern)
        (has_key turquoise_key knights_hall)
        (has_key diamond_key enchanted_hall)
        (has_key diamond_key mirror_chamber)
        (has_key amethyst_key mirror_chamber)
        (has_key topaz_key mirror_chamber)
        (has_key topaz_key wizards_study)

        (blocks wizards_study mirror_chamber)
        (blocks moonlit_grove enchanted_hall)
        (blocks mystic_garden moonlit_grove)
        (blocks starlit_tower sunken_crypt)
        (blocks silent_tomb shadowy_vault)
        (blocks echoing_cavern moonlit_grove)
        (blocks haunted_chamber wizards_study)
        (blocks forbidden_throne whispering_gallery)
        (blocks whispering_gallery enchanted_hall)
        (blocks enchanted_hall whispering_gallery)
        (blocks mirror_chamber enchanted_hall)
        (blocks dragon_lair whispering_gallery)
        (blocks knights_hall serpents_nest)
        (blocks crystal_cove serpents_nest)
        (blocks shadowy_vault wizards_study)
        (blocks sunken_crypt enchanted_hall)
        (blocks frozen_cell dragon_lair)
        (blocks phantom_corridor shadowy_vault)
        (blocks serpents_nest moonlit_grove)
        (blocks golden_sanctum moonlit_grove)
       
    )
    (:goal
        (and (at forbidden_throne))
    )
)

; plan
1. (pickup_key whispering_gallery sapphire_key)
   added: (got_key sapphire_key)
   goals met: 0 of 1
2. (pickup_key whispering_gallery emerald_key)
   added: (got_key emerald_key)
   goals met: 0 of 1
3. (move whispering_gallery enchanted_hall whispering_gallery sapphire_key emerald_key)
   deleted: (at whispering_gallery)
   added: (blocked whispering_gallery) (at enchanted_hall) (opened_with enchanted_hall sapphire_key emerald_key)
   goals met: 0 of 1
4. (pickup_key enchanted_hall ruby_key)
   added: (got_key ruby_key)
   goals met: 0 of 1
5. (pickup_key enchanted_hall diamond_key)
   added: (got_key diamond_key)
   goals met: 0 of 1
6. (move enchanted_hall mirror_chamber enchanted_hall ruby_key diamond_key)
   deleted: (at enchanted_hall)
   added: (blocked enchanted_hall) (at mirror_chamber) (opened_with mirror_chamber ruby_key diamond_key)
   goals met: 0 of 1
7. (pickup_key mirror_chamber amethyst_key)
   added: (got_key amethyst_key)
   goals met: 0 of 1
8. (pickup_key mirror_chamber topaz_key)
   added: (got_key topaz_key)
   goals met: 0 of 1
9. (move mirror_chamber wizards_study mirror_chamber diamond_key topaz_key)
   deleted: (at mirror_chamber)
   added: (blocked mirror_chamber) (at wizards_study) (opened_with wizards_study diamond_key topaz_key)
   goals met: 0 of 1
10. (pickup_key wizards_study opal_key)
   added: (got_key opal_key)
   goals met: 0 of 1
11. (move wizards_study moonlit_grove enchanted_hall amethyst_key opal_key)
   deleted: (at wizards_study)
   added: (at moonlit_grove) (opened_with moonlit_grove amethyst_key opal_key)
   goals met: 0 of 1
12. (pickup_key moonlit_grove pearl_key)
   added: (got_key pearl_key)
   goals met: 0 of 1
13. (move moonlit_grove shadowy_vault wizards_study topaz_key pearl_key)
   deleted: (at moonlit_grove)
   added: (blocked wizards_study) (at shadowy_vault) (opened_with shadowy_vault topaz_key pearl_key)
   goals met: 0 of 1
14. (pickup_key shadowy_vault garnet_key)
   added: (got_key garnet_key)
   goals met: 0 of 1
15. (move shadowy_vault sunken_crypt enchanted_hall opal_key garnet_key)
   deleted: (at shadowy_vault)
   added: (at sunken_crypt) (opened_with sunken_crypt opal_key garnet_key)
   goals met: 0 of 1
16. (pickup_key sunken_crypt onyx_key)
   added: (got_key onyx_key)
   goals met: 0 of 1
17. (move sunken_crypt frozen_cell dragon_lair pearl_key onyx_key)
   deleted: (at sunken_crypt)
   added: (blocked dragon_lair) (at frozen_cell) (opened_with frozen_cell pearl_key onyx_key)
   goals met: 0 of 1
18. (pickup_key frozen_cell moonstone_key)
   added: (got_key moonstone_key)
   goals met: 0 of 1
19. (move frozen_cell phantom_corridor shadowy_vault garnet_key moonstone_key)
   deleted: (at frozen_cell)
   added: (blocked shadowy_vault) (at phantom_corridor) (opened_with phantom_corridor garnet_key moonstone_key)
   goals met: 0 of 1
20. (pickup_key phantom_corridor sunstone_key)
   added: (got_key sunstone_key)
   goals met: 0 of 1
21. (move phantom_corridor serpents_nest moonlit_grove onyx_key sunstone_key)
   deleted: (at phantom_corridor)
   added: (blocked moonlit_grove) (at serpents_nest) (opened_with serpents_nest onyx_key sunstone_key)
   goals met: 0 of 1
22. (pickup_key serpents_nest quartz_key)
   added: (got_key quartz_key)
   goals met: 0 of 1
23. (move serpents_nest knights_hall serpents_nest moonstone_key quartz_key)
   deleted: (at serpents_nest)
   added: (blocked serpents_nest) (at knights_hall) (opened_with knights_hall moonstone_key quartz_key)
   goals met: 0 of 1
24. (pickup_key knights_hall jade_key)
   added: (got_key jade_key)
   goals met: 0 of 1
25. (pickup_key knights_hall turquoise_key)
   added: (got_key turquoise_key)
   goals met: 0 of 1
26. (move knights_hall crystal_cove serpents_nest quartz_key jade_key)
   deleted: (at knights_hall)
   added: (at crystal_cove) (opened_with crystal_cove quartz_key jade_key)
   goals met: 0 of 1
27. (pickup_key crystal_cove obsidian_key)
   added: (got_key obsidian_key)
   goals met: 0 of 1
28. (move crystal_cove mystic_garden moonlit_grove turquoise_key obsidian_key)
   deleted: (at crystal_cove)
   added: (at mystic_garden) (opened_with mystic_garden turquoise_key obsidian_key)
   goals met: 0 of 1
29. (pickup_key mystic_garden amber_key)
   added: (got_key amber_key)
   goals met: 0 of 1
30. (move mystic_garden starlit_tower sunken_crypt jade_key amber_key)
   deleted: (at mystic_garden)
   added: (blocked sunken_crypt) (at starlit_tower) (opened_with starlit_tower jade_key amber_key)
   goals met: 0 of 1
31. (pickup_key starlit_tower citrine_key)
   added: (got_key citrine_key)
   goals met: 0 of 1
32. (move starlit_tower silent_tomb shadowy_vault obsidian_key citrine_key)
   deleted: (at starlit_tower)
   added: (at silent_tomb) (opened_with silent_tomb obsidian_key citrine_key)
   goals met: 0 of 1
33. (pickup_key silent_tomb lapis_key)
   added: (got_key lapis_key)
   goals met: 0 of 1
34. (move silent_tomb echoing_cavern moonlit_grove amber_key lapis_key)
   deleted: (at silent_tomb)
   added: (at echoing_cavern) (opened_with echoing_cavern amber_key lapis_key)
   goals met: 0 of 1
35. (pickup_key echoing_cavern agate_key)
   added: (got_key agate_key)
   goals met: 0 of 1
36. (move echoing_cavern forbidden_throne whispering_gallery lapis_key agate_key)
   deleted: (at echoing_cavern)
   added: (at forbidden_throne) (opened_with forbidden_throne lapis_key agate_key)
   goals met: 1 of 1
